package com.beour.space.guest.controller;

import static org.junit.jupiter.api.Assertions.*;

class GuestSpaceControllerTest {

    /**
     * 근처 장소 검색
     * - 성공
     * - 근처 장소 없을경우...?
     * - 근처 장소 검색 => 사용자 로그인 안했을 경우..?
     */


    /**
     * 장소 검색
     * - 성공
     * - 해당 장소 없을 경우
     * - 검색어 입력안했을경우
     */

    /**
     * 장소 검색후 필터링
     * - 성공
     * - 필터링 선택안했을 경우
     * - 주소 필터링
     * - 가격 필터링
     * - 최소인원 필터링
     * - 용도 카테고리 필터링
     * - 유형 카테고리 필터링
     */

    /**
     * 용도별 카테고리 필터링
     * - 성공
     * - 장소 없을 경우
     */

    /**
     * 유형별 카테고리 필터링
     * - 성공
     * - 장소 없을 경우
     */

    /**
     * 최근에 생긴 장소
     * - 성공
     * - 장소 없을 경우
     */

}